tap "coursier/formulas"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "scalacenter/bloop"
brew "asciidoctor"
brew "automake"
brew "gettext"
brew "axel"
brew "bat"
brew "carthage"
brew "catimg"
brew "coreutils"
brew "defaultbrowser"
brew "delve"
brew "exa"
brew "fd"
brew "fzf"
brew "gdbm"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "mpdecimal"
brew "xz"
brew "python@3.10"
brew "google-java-format"
brew "httpie"
brew "jq"
brew "libtool"
brew "maven"
brew "neovim", args: ["HEAD"]
brew "ninja"
brew "node"
brew "pkg-config"
brew "postgresql"
brew "procs"
brew "protobuf"
brew "ripgrep"
brew "smartmontools"
brew "tmux"
brew "tree"
brew "wget"
brew "coursier/formulas/coursier"
brew "jesseduffield/lazygit/lazygit"
cask "iina"
cask "transmission"
