{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp",
      "version": ">=0.0.0"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": ">=0.0.0"
    },
    "crates.nvim": {
      "src": "https://github.com/saecki/crates.nvim",
      "version": ">=0.0.0"
    },
    "diffview.nvim": {
      "src": "https://github.com/sindrets/diffview.nvim",
      "version": "'main'"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": ">=0.0.0"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets",
      "version": "'main'"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua",
      "version": ">=0.0.0"
    },
    "gitlinker.nvim": {
      "src": "https://github.com/linrongbin16/gitlinker.nvim",
      "version": ">=0.0.0"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim",
      "version": ">=0.0.0"
    },
    "helm-ls.nvim": {
      "src": "https://github.com/qvalentin/helm-ls.nvim",
      "version": "'main'"
    },
    "kulala.nvim": {
      "src": "https://github.com/mistweaverco/kulala.nvim",
      "version": "'v5.3.3'"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim",
      "version": ">=0.0.0"
    },
    "lz.n": {
      "src": "https://github.com/lumen-oss/lz.n"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": ">=0.0.0"
    },
    "mini.files": {
      "src": "https://github.com/nvim-mini/mini.files",
      "version": ">=0.0.0"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": ">=0.0.0"
    },
    "nvim-metals": {
      "src": "https://github.com/scalameta/nvim-metals",
      "version": "'main'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context",
      "version": "'master'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons",
      "version": "'master'"
    },
    "obsidian.nvim": {
      "src": "https://github.com/obsidian-nvim/obsidian.nvim",
      "version": ">=0.0.0"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'master'"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim",
      "version": ">=0.0.0"
    },
    "schemastore.nvim": {
      "src": "https://github.com/b0o/schemastore.nvim",
      "version": "'main'"
    },
    "sidekick.nvim": {
      "src": "https://github.com/folke/sidekick.nvim",
      "version": ">=0.0.0"
    },
    "wezterm-types": {
      "src": "https://github.com/DrKJeff16/wezterm-types",
      "version": ">=0.0.0"
    }
  }
}